app/views/microposts/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."micropost_id" = ?  [["micropost_id", 2]]
---
	    	<i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
	    	<%= @micropost.likes.count %> いいね

SELECT COUNT(*) FROM "likes" WHERE "likes"."micropost_id" = ?  [["micropost_id", 2]]
---
	    	<i class="far fa-heart" aria-hidden="true"></i>
	    	<%= @micropost.likes.count %> いいね