app/controllers/likes_controller.rb

	def create
		micropost = Micropost.find(params[:micropost_id])
		like = current_user.likes.new(micropost_id: micropost.id)
		like.save
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["micropost_id", 2], ["created_at", "2019-08-29 13:15:57.156835"], ["updated_at", "2019-08-29 13:15:57.156835"]]

	def destroy
		micropost = Micropost.find(params[:micropost_id])
		like = current_user.likes.find_by(micropost_id: micropost.id)
		like.destroy
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."micropost_id" = ? LIMIT ?  [["user_id", 1], ["micropost_id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]