app/controllers/microposts_controller.rb

	def create
		@micropost = Micropost.new(micropost_params)
		@micropost.user = current_user
		if @micropost.save
---
INSERT INTO "microposts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "投稿１"], ["body", "投稿"], ["user_id", 1], ["created_at", "2019-08-29 12:05:02.405188"], ["updated_at", "2019-08-29 12:05:02.405188"]]

	def index
		@microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts"

	def show
		@micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@micropost = Micropost.find(params[:id])
		@micropost.user = current_user
		if @micropost.update(micropost_params)
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "microposts" SET "body" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["body", "投稿(編集した)"], ["updated_at", "2019-08-29 12:14:14.678447"], ["id", 1]]

	def destroy
		@micropost = Micropost.find(params[:id])
		@micropost.destroy
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 1]]